///**********************************************************************************
///
///=================================
///CLR版本		：4.0.30319.42000
///命名空间		：LYDLib.Common.Models
///文件名称		：Enums
///=================================
///创建者		：midsun
///创建日期		：2018-12-17 13:04:57
///=================================
///功能描述		：
///使用说明		：
///修改人		：midsun
///
///**********************************************************************************

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace LYDLib.Common.Models
{
    public class Enums
    {
        public enum LoginStatus
        {
            初始化 = 1,
            等待扫描 = 2,
            在线 = 3,
            离线 = 4,
            隐身 = 5,
            忙碌 = 6,
            勿扰 = 7
        }
        public enum MsgType
        {
            纯文本 = 2,
            网页 = 3,
            图片 = 8,
            文件 = 8,
            撤回 = 9,
            文档 = 6,
            语音 = 34,
            视频 = 43,
            表情 = 47,
            通知 = 51,
            系统 = 10000
        }
    }
}
